{"class_name": "Model", "keras_version": "2.1.6", "backend": "tensorflow", "config": {"name": "x-vgg16", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 256, 224, 3], "name": "input_1", "dtype": "float32", "sparse": false}}, {"name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block1_conv1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block1_conv2", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"padding": "valid", "name": "block1_pool", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"name": "block2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block2_conv1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block2_conv2", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"padding": "valid", "name": "block2_pool", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"name": "block3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"filters": 256, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block3_conv1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"filters": 256, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block3_conv2", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block3_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"filters": 256, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block3_conv3", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"padding": "valid", "name": "block3_pool", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"name": "block4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"filters": 512, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block4_conv1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block4_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"filters": 512, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block4_conv2", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block4_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"filters": 512, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block4_conv3", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"padding": "valid", "name": "block4_pool", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"name": "block5_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"filters": 512, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block5_conv1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block5_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"filters": 512, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block5_conv2", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block5_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"filters": 512, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "block5_conv3", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"padding": "valid", "name": "block5_pool", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"name": "decoder_stage5-1_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"name": "decoder_stage5-1_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "merge_5-1", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage5-1_upsample", 0, 0, {}], ["block5_conv3", 0, 0, {}]]], "config": {"name": "merge_5-1", "trainable": true, "axis": -1}}, {"name": "decoder_stage4-1_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"name": "decoder_stage4-1_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage5-1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_5-1", 0, 0, {}]]], "config": {"filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage5-1_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "merge_4-1", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage4-1_upsample", 0, 0, {}], ["block4_conv3", 0, 0, {}]]], "config": {"name": "merge_4-1", "trainable": true, "axis": -1}}, {"name": "decoder_stage3-1_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"name": "decoder_stage3-1_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage5-1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage5-1_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage5-1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage4-1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_4-1", 0, 0, {}]]], "config": {"filters": 256, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage4-1_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "merge_3-1", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage3-1_upsample", 0, 0, {}], ["block3_conv3", 0, 0, {}]]], "config": {"name": "merge_3-1", "trainable": true, "axis": -1}}, {"name": "decoder_stage2-1_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"name": "decoder_stage2-1_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage5-1_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage5-1_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage5-1_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage4-1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage4-1_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage4-1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage3-1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_3-1", 0, 0, {}]]], "config": {"filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage3-1_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "merge_2-1", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage2-1_upsample", 0, 0, {}], ["block2_conv2", 0, 0, {}]]], "config": {"name": "merge_2-1", "trainable": true, "axis": -1}}, {"name": "decoder_stage1-1_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"name": "decoder_stage1-1_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage5-1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage5-1_relu1", 0, 0, {}]]], "config": {"filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage5-1_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage4-1_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage4-1_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage4-1_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage3-1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3-1_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage3-1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage2-1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_2-1", 0, 0, {}]]], "config": {"filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage2-1_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "merge_1-1", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage1-1_upsample", 0, 0, {}], ["block1_conv2", 0, 0, {}]]], "config": {"name": "merge_1-1", "trainable": true, "axis": -1}}, {"name": "decoder_stage5-1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage5-1_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage5-1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage4-1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage4-1_relu1", 0, 0, {}]]], "config": {"filters": 256, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage4-1_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage3-1_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3-1_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage3-1_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage2-1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2-1_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage2-1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage1-1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_1-1", 0, 0, {}]]], "config": {"filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage1-1_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage5-1_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage5-1_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage5-1_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage4-1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage4-1_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage4-1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage3-1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage3-1_relu1", 0, 0, {}]]], "config": {"filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage3-1_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage2-1_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2-1_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage2-1_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage1-1_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1-1_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage1-1_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage4-2_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage5-1_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage4-2_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage4-1_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage4-1_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage4-1_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage3-1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3-1_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage3-1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage2-1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage2-1_relu1", 0, 0, {}]]], "config": {"filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage2-1_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage1-1_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1-1_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage1-1_relu1", "activation": "relu", "trainable": true}}, {"name": "merge_4-2", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage4-2_upsample", 0, 0, {}], ["block4_conv3", 0, 0, {}], ["decoder_stage4-1_relu2", 0, 0, {}]]], "config": {"name": "merge_4-2", "trainable": true, "axis": -1}}, {"name": "decoder_stage3-1_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3-1_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage3-1_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage3-2_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage4-1_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage3-2_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage2-1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2-1_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage2-1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage1-1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage1-1_relu1", 0, 0, {}]]], "config": {"filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage1-1_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage4-2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_4-2", 0, 0, {}]]], "config": {"filters": 256, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage4-2_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "merge_3-2", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage3-2_upsample", 0, 0, {}], ["block3_conv3", 0, 0, {}], ["decoder_stage3-1_relu2", 0, 0, {}]]], "config": {"name": "merge_3-2", "trainable": true, "axis": -1}}, {"name": "decoder_stage2-1_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2-1_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage2-1_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage2-2_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage3-1_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage2-2_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage1-1_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1-1_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage1-1_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage4-2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage4-2_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage4-2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage3-2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_3-2", 0, 0, {}]]], "config": {"filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage3-2_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "merge_2-2", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage2-2_upsample", 0, 0, {}], ["block2_conv2", 0, 0, {}], ["decoder_stage2-1_relu2", 0, 0, {}]]], "config": {"name": "merge_2-2", "trainable": true, "axis": -1}}, {"name": "decoder_stage1-1_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1-1_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage1-1_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage1-2_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage2-1_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage1-2_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage4-2_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage4-2_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage4-2_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage3-2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3-2_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage3-2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage2-2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_2-2", 0, 0, {}]]], "config": {"filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage2-2_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "merge_1-2", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage1-2_upsample", 0, 0, {}], ["block1_conv2", 0, 0, {}], ["decoder_stage1-1_relu2", 0, 0, {}]]], "config": {"name": "merge_1-2", "trainable": true, "axis": -1}}, {"name": "decoder_stage4-2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage4-2_relu1", 0, 0, {}]]], "config": {"filters": 256, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage4-2_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage3-2_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3-2_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage3-2_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage2-2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2-2_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage2-2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage1-2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_1-2", 0, 0, {}]]], "config": {"filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage1-2_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage4-2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage4-2_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage4-2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage3-2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage3-2_relu1", 0, 0, {}]]], "config": {"filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage3-2_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage2-2_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2-2_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage2-2_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage1-2_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1-2_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage1-2_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage4-2_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage4-2_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage4-2_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage3-2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3-2_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage3-2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage2-2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage2-2_relu1", 0, 0, {}]]], "config": {"filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage2-2_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage1-2_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1-2_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage1-2_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage3-3_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage4-2_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage3-3_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage3-2_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3-2_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage3-2_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage2-2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2-2_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage2-2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage1-2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage1-2_relu1", 0, 0, {}]]], "config": {"filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage1-2_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "merge_3-3", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage3-3_upsample", 0, 0, {}], ["block3_conv3", 0, 0, {}], ["decoder_stage3-1_relu2", 0, 0, {}], ["decoder_stage3-2_relu2", 0, 0, {}]]], "config": {"name": "merge_3-3", "trainable": true, "axis": -1}}, {"name": "decoder_stage2-2_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2-2_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage2-2_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage2-3_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage3-2_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage2-3_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage1-2_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1-2_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage1-2_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage3-3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_3-3", 0, 0, {}]]], "config": {"filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage3-3_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "merge_2-3", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage2-3_upsample", 0, 0, {}], ["block2_conv2", 0, 0, {}], ["decoder_stage2-1_relu2", 0, 0, {}], ["decoder_stage2-2_relu2", 0, 0, {}]]], "config": {"name": "merge_2-3", "trainable": true, "axis": -1}}, {"name": "decoder_stage1-2_relu2", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1-2_bn2", 0, 0, {}]]], "config": {"name": "decoder_stage1-2_relu2", "activation": "relu", "trainable": true}}, {"name": "decoder_stage1-3_upsample", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_stage2-2_relu2", 0, 0, {}]]], "config": {"name": "decoder_stage1-3_upsample", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage3-3_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3-3_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage3-3_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage2-3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_2-3", 0, 0, {}]]], "config": {"filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage2-3_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "merge_1-3", "class_name": "Concatenate", "inbound_nodes": [[["decoder_stage1-3_upsample", 0, 0, {}], ["block1_conv2", 0, 0, {}], ["decoder_stage1-1_relu2", 0, 0, {}], ["decoder_stage1-2_relu2", 0, 0, {}]]], "config": {"name": "merge_1-3", "trainable": true, "axis": -1}}, {"name": "decoder_stage3-3_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage3-3_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage3-3_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage2-3_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage2-3_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage2-3_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage1-3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["merge_1-3", 0, 0, {}]]], "config": {"filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage1-3_conv1", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage3-3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage3-3_relu1", 0, 0, {}]]], "config": {"filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage3-3_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage2-3_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage2-3_bn1", 0, 0, {}]]], "config": {"name": "decoder_stage2-3_relu1", "activation": "relu", "trainable": true}}, {"name": "decoder_stage1-3_bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage1-3_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage1-3_bn1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage3-3_bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["decoder_stage3-3_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "center": true, "name": "decoder_stage3-3_bn2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "decoder_stage2-3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["decoder_stage2-3_relu1", 0, 0, {}]]], "config": {"filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "decoder_stage2-3_conv2", "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"name": "decoder_stage1-3_relu1", "class_name": "Activation", "inbound_nodes": [[["decoder_stage1-3_bn1", 0, 0, {}]]], "config": {"name": 